{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/akirasato/Docs/stata_introduction/May7/do_files_etc/stataoutput2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 May 2020, 15:41:57
{txt}
{com}. 
. * 使うデータセットをダウンロードする
. * 途中から緑になってるけど，大丈夫。
. import delimited AER_credit_card_data.csv
{res}{text}(12 vars, 1,319 obs)

{com}. 
. 
. 
. * データの概要を表示する（sumでも大丈夫）
. summarize

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}card {c |}{res}          0
{txt}{space 5}reports {c |}{res}      1,319    .4564064    1.345267          0         14
{txt}{space 9}age {c |}{res}      1,319     33.2131    10.14278   .1666667       83.5
{txt}{space 6}income {c |}{res}      1,319    3.365376    1.693902        .21       13.5
{txt}{space 7}share {c |}{res}      1,319    .0687322    .0946556   .0001091   .9063205
{txt}{hline 13}{c +}{hline 57}
{space 1}expenditure {c |}{res}      1,319    185.0571    272.2189          0   3099.505
{txt}{space 7}owner {c |}{res}          0
{txt}{space 5}selfemp {c |}{res}          0
{txt}{space 2}dependents {c |}{res}      1,319    .9939348    1.247745          0          6
{txt}{space 6}months {c |}{res}      1,319    55.26763    66.27175          0        540
{txt}{hline 13}{c +}{hline 57}
{space 2}majorcards {c |}{res}      1,319    .8172858    .3865786          0          1
{txt}{space 6}active {c |}{res}      1,319    6.996967    6.305812          0         46
{txt}
{com}. 
. 
. * ヒストグラムを表示する
. hist income
{txt}(bin={res}31{txt}, start={res}.20999999{txt}, width={res}.42870968{txt})
{res}{txt}
{com}. * 保存しましょう（pngで）
. graph export hist2.png, replace
{txt}(file /Users/akirasato/Docs/stata_introduction/May7/do_files_etc/hist2.png written in PNG format)

{com}. 
. 
. * 散布図を表示する
. scatter expenditure income
{res}{txt}
{com}. * 保存しましょう（今度は...jpgで）
. graph export scat1.jpg, replace
{txt}(file /Users/akirasato/Docs/stata_introduction/May7/do_files_etc/scat1.jpg written in JPG format)

{com}. 
. reg expenditure income, r

{txt}Linear regression                               Number of obs     = {res}     1,319
                                                {txt}F(1, 1317)        =  {res}    26.94
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0790
                                                {txt}Root MSE          =    {res} 261.34

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} expenditure{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}income {c |}{col 14}{res}{space 2} 45.17489{col 26}{space 2} 8.703226{col 37}{space 1}    5.19{col 46}{space 3}0.000{col 54}{space 4} 28.10119{col 67}{space 3} 62.24859
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 33.02657{col 26}{space 2}  26.5988{col 37}{space 1}    1.24{col 46}{space 3}0.215{col 54}{space 4}-19.15408{col 67}{space 3} 85.20721
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. reg expenditure income age, r

{txt}Linear regression                               Number of obs     = {res}     1,319
                                                {txt}F(2, 1316)        =  {res}    20.72
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0855
                                                {txt}Root MSE          =    {res} 260.52

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} expenditure{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}income {c |}{col 14}{res}{space 2} 49.62554{col 26}{space 2} 8.866658{col 37}{space 1}    5.60{col 46}{space 3}0.000{col 54}{space 4} 32.23121{col 67}{space 3} 67.01986
{txt}{space 9}age {c |}{col 14}{res}{space 2}-2.289466{col 26}{space 2} .5502782{col 37}{space 1}   -4.16{col 46}{space 3}0.000{col 54}{space 4}-3.368984{col 67}{space 3}-1.209948
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 94.08874{col 26}{space 2} 30.20973{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} 34.82426{col 67}{space 3} 153.3532
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. gen income_quad = income^2
{txt}
{com}. 
. reg expenditure income income_quad age, r

{txt}Linear regression                               Number of obs     = {res}     1,319
                                                {txt}F(3, 1315)        =  {res}    25.09
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0858
                                                {txt}Root MSE          =    {res} 260.58

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} expenditure{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}income {c |}{col 14}{res}{space 2} 40.78271{col 26}{space 2} 36.78715{col 37}{space 1}    1.11{col 46}{space 3}0.268{col 54}{space 4} -31.3852{col 67}{space 3} 112.9506
{txt}{space 1}income_quad {c |}{col 14}{res}{space 2} .8755535{col 26}{space 2} 4.268642{col 37}{space 1}    0.21{col 46}{space 3}0.838{col 54}{space 4}-7.498538{col 67}{space 3} 9.249645
{txt}{space 9}age {c |}{col 14}{res}{space 2}-2.240863{col 26}{space 2} .5946707{col 37}{space 1}   -3.77{col 46}{space 3}0.000{col 54}{space 4} -3.40747{col 67}{space 3}-1.074256
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 109.8073{col 26}{space 2} 60.20105{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-8.293293{col 67}{space 3} 227.9079
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/3n/xs20lgfn0037tdqm3c71s2x40000gn/T//SD68113.000000"
{txt}
{com}. /*
> 一番最初に使ったDoファイルです。
> 
> ちなみに複数行のコメントはこうやって書きます。（色が緑になります。）
> */
. 
. 
. * 保存されているデータなどを全て消去する
. clear all
{res}{txt}
{com}. 
. * logファイル（Stataのアウトプットが保存されているファイル）を閉じる
. capture log close
{smcl}
{com}{sf}{ul off}